<template>
  <div id="pay_modal">
    <div class="modal_icon">
        <svg xmlns="http://www.w3.org/2000/svg" width="107" height="108" viewBox="0 0 107 108" fill="none">
            <path opacity="0.4" d="M76.646 0.665527H30.406C12.326 0.665527 0.166016 13.3589 0.166016 32.2389V75.8122C0.166016 94.6389 12.326 107.332 30.406 107.332H76.646C94.726 107.332 106.833 94.6389 106.833 75.8122V32.2389C106.833 13.3589 94.726 0.665527 76.646 0.665527" fill="#C7FF24"/>
            <path d="M47.1681 71.3226C45.9734 71.3226 44.7788 70.8692 43.8668 69.9572L31.2108 57.3012C29.3868 55.4772 29.3868 52.5226 31.2108 50.7039C33.0348 48.8799 35.9841 48.8746 37.8081 50.6986L47.1681 60.0586L69.1841 38.0426C71.0081 36.2186 73.9574 36.2186 75.7814 38.0426C77.6054 39.8666 77.6054 42.8212 75.7814 44.6452L50.4694 69.9572C49.5574 70.8692 48.3628 71.3226 47.1681 71.3226" fill="#C7FF24"/>
        </svg>
    </div>
    <h3>Оплата прошла успешно!</h3>
    <div class="modal_main">
        <div class="modal_block">
            <p>Сумма:</p>
            <h4>$24,000</h4>
        </div>
        <div class="modal_block">
            <p>Получатель:</p>
            <h5>Иванов Иван</h5>
        </div>
        <div class="modal_block">
            <p>Дата транказции:</p>
            <h5>24.05.2023 в 18:00</h5>
        </div>
        <div class="modal_block">
            <p>ID транзакции:</p>
            <h5>123214Af12</h5>
        </div>
    </div>
    <button class="main_btn">Закрыть окно</button>
  </div>    
</template>

<script>
export default {
    name: "PayModal"
}
</script>

<style>

</style>